### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.io_platform_apim_api.azurerm_api_management_api.io_sign will be created
  + resource "azurerm_api_management_api" "io_sign" {
      + api_management_name   = "io-p-itn-platform-api-gateway-apim-01"
      + api_type              = (known after apply)
      + description           = "IO Sign Backend API"
      + display_name          = "IO Sign Backend"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "io-p-sign-api"
      + path                  = "api/sign"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-common-rg-01"
      + revision              = "1"
      + service_url           = (known after apply)
      + soap_pass_through     = (known after apply)
      + subscription_required = false
      + version               = "v1"
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi-link"
          + content_value  = "https://raw.githubusercontent.com/pagopa/io-backend/158cff2cf879a06fe1a5af218fc9adf5bda90681/openapi/generated/api_io_sign.yaml"
        }
    }

  # module.io_platform_apim_api.azurerm_api_management_api_policy.io_sign will be created
  + resource "azurerm_api_management_api_policy" "io_sign" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-p-sign-api"
      + id                  = (known after apply)
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                    <include-fragment fragment-id="ioapp-authenticated" />
                    <set-backend-service id="apim-pool-app-backend"
                        backend-id="app-backend-pool" />
                    <set-header name="x-appbackend-api-key" exists-action="override">
                        <value>{{io-sign-app-backend-key}}</value>
                    </set-header>
                    <rewrite-uri template="@(context.Request.OriginalUrl.Path)" />
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.io_platform_apim_api.azurerm_api_management_api_tag.io_sign_api_tag will be created
  + resource "azurerm_api_management_api_tag" "io_sign_api_tag" {
      + api_id = (known after apply)
      + id     = (known after apply)
      + name   = "IOSign"
    }

  # module.io_platform_apim_api.azurerm_api_management_api_version_set.io_sign_v1 will be created
  + resource "azurerm_api_management_api_version_set" "io_sign_v1" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + display_name        = "IO Sign Backend v1"
      + id                  = (known after apply)
      + name                = "io_sign_v1"
      + resource_group_name = "io-p-itn-common-rg-01"
      + versioning_scheme   = "Segment"
    }

  # module.io_platform_apim_api.azurerm_api_management_named_value.app_backend_key will be created
  + resource "azurerm_api_management_named_value" "app_backend_key" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + display_name        = "io-sign-app-backend-key"
      + id                  = (known after apply)
      + name                = "io-sign-app-backend-key"
      + resource_group_name = "io-p-itn-common-rg-01"
      + secret              = true
      + value               = (sensitive value)
    }

  # module.io_platform_apim_api.azurerm_api_management_product_api.io_sign will be created
  + resource "azurerm_api_management_product_api" "io_sign" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-p-sign-api"
      + id                  = (known after apply)
      + product_id          = "io-sign"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

  # module.io_platform_apim_api.azurerm_api_management_tag.io_sign_tag will be created
  + resource "azurerm_api_management_tag" "io_sign_tag" {
      + api_management_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01"
      + display_name      = (known after apply)
      + id                = (known after apply)
      + name              = "IOSign"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.cosmosdb_account.azurerm_cosmosdb_account.this,
  on .terraform/modules/cosmosdb_account/cosmosdb_account/main.tf line 7, in resource "azurerm_cosmosdb_account" "this":
   7:   enable_free_tier          = var.enable_free_tier

This property has been superseded by `free_tier_enabled` and will be removed
in v4.0 of the AzureRM Provider

(and 30 more similar warnings elsewhere)

Warning: Deprecated attribute

  on .terraform/modules/cosmosdb_account/cosmosdb_account/output.tf line 54, in output "connection_strings":
  54:   value     = azurerm_cosmosdb_account.this.connection_strings

The attribute "connection_strings" is deprecated. Refer to the provider
documentation for details.

(and one more similar warning elsewhere)
```

</details>
